brew "go"
brew "aws-iam-authenticator"
brew "awscli" 
brew "python@3.9"
brew "pipx"
brew "buf"
brew "kubectl"
brew "libpq@17"
brew "temporal"
brew "terraform"
brew "aws-sso-util"
brew "node"
brew "k9s"
brew "kubectl"
brew "podman"
brew "podman-compose"
brew "aws-nuke"
brew "gum"
brew "sevenzip"
