{"op": "install", "plan": "\u001b[0;32mctl-api, ctl-api, ClusterRole (rbac.authorization.k8s.io) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api, ConfigMap (v1) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api, Role (rbac.authorization.k8s.io) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api, ServiceAccount (v1) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-admin, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-admin, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-admin, PodDisruptionBudget (policy) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-admin, Service (v1) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-public, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-public, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-public, Ingress (networking.k8s.io) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-public, PodDisruptionBudget (policy) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-public, Service (v1) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-rolebinding, ClusterRoleBinding (rbac.authorization.k8s.io) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-rolebinding, RoleBinding (rbac.authorization.k8s.io) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-runner, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-runner, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-runner, Ingress (networking.k8s.io) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-runner, PodDisruptionBudget (policy) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-runner, Service (v1) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-startup, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-actions, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-actions, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-apps, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-apps, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-components, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-components, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-general, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-general, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-installs, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-installs, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-orgs, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-orgs, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-releases, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-releases, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-runners, Deployment (apps) to be added.\u001b[0m\n\u001b[0;32mctl-api, ctl-api-worker-runners, HorizontalPodAutoscaler (autoscaling) to be added.\u001b[0m\nPlan: 37 to add, 0 to change, 0 to destroy.\n"}

